# Конфигурационный файл

# Алфавит для шифрования по строке (размер должен быть четным!)
alphabetString = ["A", "B", "C", "D", "E", "F", 
                  "G", "H", "I", "J", "K", "L",
                  "M", "N", "O", "P", "Q", "R",
                  "S", "T", "U", "V", "W", "X", 
                  "Y", "Z", " ", "?", "!", ","]

# Количество роторов для Энигмы
rotorCount = 3

# Файл для тестирования по шифровальной машины по умолчанию
defaultTestProgram = "./testProg/main.exe"

# Название зашифрованного файла
encodedFile = "encoded.bin"

# Название расшифрованного файла
decodedFile = "decoded.bin"